### importing Dependencies

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

### CSV files

In [2]:
# Extracting data from csv files using pandas
pet_licenses_data=pd.read_csv('./project/seattle_pet_licenses.csv')

income_data=pd.read_csv('./project/wa_incomes_zip_code.csv')

zip_code_data=pd.read_csv('./project/zip_code.csv')

### Data Cleaning and Table Merge

In [3]:
# Transformation data pet_licenses_data and zip_code_data 
pet_licenses_data=pet_licenses_data.rename(columns={'zip_code':'Zip Code'})

zip_code_data["Zip Code"]=zip_code_data["Zip Code"].astype(str)

In [4]:
# Cleaning pet_licenses_data using inner join with zip_code_data and save to target_data dataframe: 
# removing all records from pet_licenses_data with incorrect zip code
target_data=pd.merge(zip_code_data,pet_licenses_data,left_on="Zip Code",right_on="Zip Code")
target_data.head()

,Zip Code,City,County,animal_s_name,license_issue_date,license_number,primary_breed,secondary_breed,species
0,98001,Auburn,King,Cookie,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,NaN,Cat
1,98004,Bellevue,King,Tofu,2015-05-21T00:00:00.000,283096.0,Maltese,NaN,Dog
2,98004,Bellevue,King,Mika,2015-02-03T00:00:00.000,84561.0,"Terrier, American Staffordshire",NaN,Dog
3,98004,Bellevue,King,Benson,2016-10-03T00:00:00.000,730707.0,Pomeranian,NaN,Dog
4,98005,Bellevue,King,Fiona,2015-05-12T00:00:00.000,361174.0,Norwegian Forest,NaN,Cat

In [5]:
# Cleaning data: removing unnecessary columns
target_data=target_data[["Zip Code","City","County","license_issue_date","license_number","primary_breed","species"]]
target_data.head()

,Zip Code,City,County,license_issue_date,license_number,primary_breed,species
0,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat
1,98004,Bellevue,King,2015-05-21T00:00:00.000,283096.0,Maltese,Dog
2,98004,Bellevue,King,2015-02-03T00:00:00.000,84561.0,"Terrier, American Staffordshire",Dog
3,98004,Bellevue,King,2016-10-03T00:00:00.000,730707.0,Pomeranian,Dog
4,98005,Bellevue,King,2015-05-12T00:00:00.000,361174.0,Norwegian Forest,Cat

In [6]:
# Cleaning income_data: removing unnecessary columns
income_data=income_data[["Zip Code","Number of returns","Adjusted Gross Income","Total Income Amount"]]
# Transforamtion: changing datatype
income_data["Zip Code"]=income_data["Zip Code"].astype(str)
income_data.head()

  Zip Code  Number of returns    Adjusted Gross Income  Total Income Amount
0    98001               4420         $1 under $25,000                55475
1    98001               3750    $25,000 under $50,000               138595
2    98001               2520    $50,000 under $75,000               158094
3    98001               1850   $75,000 under $100,000               162024
4    98001               2680  $100,000 under $200,000               363321

In [7]:
# Adding addtional data from income data to target dataset
target_data=pd.merge(target_data,income_data,left_on="Zip Code",right_on="Zip Code")
target_data.head()

,Zip Code,City,County,license_issue_date,license_number,primary_breed,species,Number of returns,Adjusted Gross Income,Total Income Amount
0,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,4420,"$1 under $25,000",55475
1,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,3750,"$25,000 under $50,000",138595
2,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,2520,"$50,000 under $75,000",158094
3,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,1850,"$75,000 under $100,000",162024
4,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,2680,"$100,000 under $200,000",363321

In [8]:
# Cleaning data: drop all na
target_data=target_data.dropna(how="any")
target_data.head()

,Zip Code,City,County,license_issue_date,license_number,primary_breed,species,Number of returns,Adjusted Gross Income,Total Income Amount
0,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,4420,"$1 under $25,000",55475
1,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,3750,"$25,000 under $50,000",138595
2,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,2520,"$50,000 under $75,000",158094
3,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,1850,"$75,000 under $100,000",162024
4,98001,Auburn,King,2016-04-22T00:00:00.000,127840.0,Domestic Medium Hair,Cat,2680,"$100,000 under $200,000",363321

In [9]:
# Cleaning target dataset:
target_data['license_issue_date']=pd.DatetimeIndex(target_data['license_issue_date']).year
# So it is number of license it cannot be float, so we change the type of data
target_data['license_number']=target_data['license_number'].astype(int)
target_data=target_data.rename(columns={"license_issue_date": "License Issue Date", "license_number": "License Number", "primary_breed": "Primary Breed","species":"Species"})
target_data['Adjusted Gross Income'] = target_data['Adjusted Gross Income'].replace({"$1 under $25,000":"<25k",
                                                   "$25,000 under $50,000": "25k-50k",
                                                   "$50,000 under $75,000": "50k-75k",
                                                   "$75,000 under $100,000": "75k-100k",
                                                   "$100,000 under $200,000": "100k-200k",
                                                   "$200,000 or more": ">200k"})

target_data.head()

,Zip Code,City,County,License Issue Date,License Number,Primary Breed,Species,Number of returns,Adjusted Gross Income,Total Income Amount
0,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,4420,<25k,55475
1,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,3750,25k-50k,138595
2,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,2520,50k-75k,158094
3,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,1850,75k-100k,162024
4,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,2680,100k-200k,363321

In [10]:
target_data.count()

Zip Code                 260274
City                     260274
County                   260274
License Issue Date       260274
License Number           260274
Primary Breed            260274
Species                  260274
Number of returns        260274
Adjusted Gross Income    260274
Total Income Amount      260274
dtype: int64

In [11]:
target_data=target_data.drop_duplicates()
target_data.count()

Zip Code                 257484
City                     257484
County                   257484
License Issue Date       257484
License Number           257484
Primary Breed            257484
Species                  257484
Number of returns        257484
Adjusted Gross Income    257484
Total Income Amount      257484
dtype: int64

In [12]:
# Aggregation target dataset
target_data=target_data.groupby(["Zip Code","City","County","License Issue Date","License Number","Primary Breed","Species"]).agg({'Number of returns': sum,'Total Income Amount':sum}).reset_index()
target_data

,Zip Code,City,County,License Issue Date,License Number,Primary Breed,Species,Number of returns,Total Income Amount
0,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,15760,1061202
1,98004,Bellevue,King,2015,84561,"Terrier, American Staffordshire",Dog,17440,4522144
2,98004,Bellevue,King,2015,283096,Maltese,Dog,17440,4522144
3,98004,Bellevue,King,2016,730707,Pomeranian,Dog,17440,4522144
4,98005,Bellevue,King,2015,361173,Norwegian Forest,Cat,9610,1380728
...,...,...,...,...,...,...,...,...,...
42909,99122,Davenport,Lincoln,2015,962256,Domestic Shorthair,Cat,1530,92762
42910,99122,Davenport,Lincoln,2015,962259,Domestic Medium Hair,Cat,1530,92762
42911,99133,Grand Coulee,Grant,2015,729672,Beagle,Dog,680,37901
42912,99203,Spokane,Spokane,2015,20454,"Poodle, Miniature",Dog,10230,900832
42913,99352,Richland,Benton,2014,894539,Boxer,Dog,15380,1356907

### Connect to Local Database

In [20]:
rds_connection_string = "DB_USER:DB_PASS@localhost:5432/license_db"

engine = create_engine(f'postgresql://{rds_connection_string}')

### Connecting to Cloud

In [13]:
import os
import psycopg2

In [16]:
engine = create_engine(f'postgres://yjwdgtspppyzvl:d97b77bc706510eaeb917e3fd9f37806a564b58316363581d4a6096aae1d7f85@ec2-18-233-32-61.compute-1.amazonaws.com:5432/daoq1dnihjoiui')

### Copy Datframe to SQL

In [17]:
#copy dataframes into database tables
target_data.to_sql('license_zip',con=engine, if_exists='replace', index=False)

### Quick check on table names

In [18]:
engine.table_names()

['license_zip']

### Fetching Values from the table

In [19]:
pd.read_sql_query('select * from license_zip', con=engine).head()

,Zip Code,City,County,License Issue Date,License Number,Primary Breed,Species,Number of returns,Total Income Amount
0,98001,Auburn,King,2016,127840,Domestic Medium Hair,Cat,15760,1061202
1,98004,Bellevue,King,2015,84561,"Terrier, American Staffordshire",Dog,17440,4522144
2,98004,Bellevue,King,2015,283096,Maltese,Dog,17440,4522144
3,98004,Bellevue,King,2016,730707,Pomeranian,Dog,17440,4522144
4,98005,Bellevue,King,2015,361173,Norwegian Forest,Cat,9610,1380728